"""
    P316【第17天】（加QQ：2250307122领取配套源码资料）
    异常
    格式：
    try:
        可能报错的代码
    except:
        出现异常执行的代码

"""
# try:
#     f = open('test_3.txt','r')
# except:
#     f = open('test_3.txt','w')

# ====================================================================================================================== P318【第17天】 捕获指定异常
"""
    NameError: name 'aa' is not defined
    
    NameError（异常类型）
    name 'aa' is not defined（异常描述信息）
    
    格式：
    try:
        可能报错的代码
    except (异常类型,...) as 异常描述信息:
        出现异常执行的代码
        异常描述信息
    
"""
try:
    print(d)
except (Exception,NameError,ZeroDivisionError) as result: # ============================================================ P322【第17天】Exception 是所有异常的父类
    print('发生异常')
    print(result)
else: # ================================================================================================================ P323【第17天】代码没有异常将会执行 else 中的代码
    print('代码没有异常，所以执行 else 中的代码')
finally: # ============================================================================================================= P324【第17天】无论代码是否有异常都执行 finally 中的代码
    print('无论代码是否有异常都执行 finally 中的代码')


# ====================================================================================================================== P325【第17天】 异常的传递
import time

try:
    f = open('test.txt','r')
    try:
        while True:
            con = f.readline()
            if len(con) == 0:
                # print('文件读取完毕')
                break
            print(con)
            time.sleep(0.5)
    except:
        print('读取异常终止')
    else:
        print('文件读取完毕')

except (Exception):
    print('该文件不存在')
finally:
    f.close()










