"""
    P195【第10天】（加QQ：2250307122领取配套源码资料）
    拆包

    交换变量值

"""
# ====================================================================================================================== P195 【第10天】 拆包：元组
num1,num2,num3,num4 = (1,2,3,4)
print(num1,num2,num3,num4)

def return_num():
    return 'A','B','C','D'

tuple_1 = return_num()
print(tuple_1) #返回一个元组

s_1,s_2,s_3,s_4 = return_num() #拆包
print(s_1,s_2,s_3,s_4)

# ====================================================================================================================== P196 【第10天】 拆包：字典
dict_1 = {'name':'Elon','sex':'男','age':48,'ID':88800}
a,b,c,d = dict_1

# 对字典拆包，取出来的是字典的key
print(a,b,c,d)
# 在对其打印key对应的value
print(dict_1[a],dict_1[b],dict_1[c],dict_1[d])


# ====================================================================================================================== P197~P198 【第10天】 交换变量的值
# 交换两个变量的值【方法1】
a = 5
b = 8

c = 0
c = a
a = b
b = c

print(a,b)

# 交换两个变量的值【方法2】
a,b = 800,999
a,b = b,a
print(a,b)





